let ParentProc = pack_array('powershell','pwsh','cmd');
DeviceProcessEvents
| where InitiatingProcessParentFileName has_any (ParentProc)
| where ProcessCommandLine contains "ntdsutil"
| project Timestamp, DeviceName, AccountName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessParentFileName, ReportId
